### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.mcp_server.aws_iam_policy.lambda_s3_access will be destroyed
  # (because aws_iam_policy.lambda_s3_access is not in configuration)
  - resource "aws_iam_policy" "lambda_s3_access" {
      - arn              = "arn:aws:iam::225903103583:policy/dx-p-euc1-lambda-s3-access-policy-01" -> null
      - attachment_count = 0 -> null
      - description      = "IAM policy for Lambda to generate pre-signed URLs for S3 knowledge base objects" -> null
      - id               = "arn:aws:iam::225903103583:policy/dx-p-euc1-lambda-s3-access-policy-01" -> null
      - name             = "dx-p-euc1-lambda-s3-access-policy-01" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::dx-p-euc1-docs-kb-s3-01/*"
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::dx-p-euc1-docs-kb-s3-01"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPATJGG7ZZPW6CDBL32R" -> null
      - tags             = {
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "Developer Experience"
          - "Owner"          = "DevEx"
          - "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        } -> null
      - tags_all         = {
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "Developer Experience"
          - "Owner"          = "DevEx"
          - "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        } -> null
        # (1 unchanged attribute hidden)
    }

  # module.mcp_server.aws_iam_role_policy_attachment.lambda_s3_access will be destroyed
  # (because aws_iam_role_policy_attachment.lambda_s3_access is not in configuration)
  - resource "aws_iam_role_policy_attachment" "lambda_s3_access" {
      - id         = "dx-p-euc1-lambda-mcp-server-role-01/arn:aws:iam::225903103583:policy/dx-p-euc1-lambda-s3-access-policy-01" -> null
      - policy_arn = "arn:aws:iam::225903103583:policy/dx-p-euc1-lambda-s3-access-policy-01" -> null
      - role       = "dx-p-euc1-lambda-mcp-server-role-01" -> null
    }

  # module.mcp_server.awscc_bedrock_data_source.docs must be replaced
-/+ resource "awscc_bedrock_data_source" "docs" {
      ~ created_at                           = "2026-02-05T13:41:51.476126403Z" -> (known after apply)
      ~ data_source_configuration            = {
          + confluence_configuration  = (known after apply)
          ~ s3_configuration          = {
              + bucket_owner_account_id = (known after apply)
              + inclusion_prefixes      = (known after apply)
                # (1 unchanged attribute hidden)
            }
          + salesforce_configuration  = (known after apply)
          + share_point_configuration = (known after apply)
          + web_configuration         = (known after apply)
            # (1 unchanged attribute hidden)
        }
      ~ data_source_id                       = "XITRER7DER" -> (known after apply)
      ~ data_source_status                   = "AVAILABLE" -> (known after apply)
      + description                          = (known after apply)
      + failure_reasons                      = (known after apply)
      ~ id                                   = "ALSBZAYABZ|XITRER7DER" -> (known after apply)
        name                                 = "dx-p-euc1-docs-bedrock-kb-01-dx-docs-data-source"
      + server_side_encryption_configuration = (known after apply)
      ~ updated_at                           = "2026-02-05T13:41:51.476126403Z" -> (known after apply)
      ~ vector_ingestion_configuration       = {
          ~ chunking_configuration              = { # forces replacement
              + fixed_size_chunking_configuration   = (known after apply)
              ~ hierarchical_chunking_configuration = {
                  ~ level_configurations = [
                      ~ {
                          ~ max_tokens = 4000 -> 1500
                        },
                      ~ {
                          ~ max_tokens = 500 -> 300
                        },
                    ]
                  ~ overlap_tokens       = 150 -> 60
                }
              + semantic_chunking_configuration     = (known after apply)
                # (1 unchanged attribute hidden)
            }
          + context_enrichment_configuration    = (known after apply)
          + custom_transformation_configuration = (known after apply)
          + parsing_configuration               = (known after apply)
        }
        # (2 unchanged attributes hidden)
    }

  # module.mcp_registry.module.portal.azurerm_cdn_frontdoor_endpoint.this will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_endpoint" "this" {
        id                       = "/subscriptions/02a23258-2e41-433c-8e9a-465b99e77bca/resourceGroups/dx-p-itn-common-rg-01/providers/Microsoft.Cdn/profiles/dx-p-weu-mcp-registry-afd-01/afdEndpoints/dx-p-weu-mcp-registry-fde-01"
        name                     = "dx-p-weu-mcp-registry-fde-01"
      ~ tags                     = {
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_cdn"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.2" -> "0.4.0"
            "Owner"          = "DevEx"
            "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        }
        # (3 unchanged attributes hidden)
    }

  # module.mcp_registry.module.portal.azurerm_cdn_frontdoor_profile.this will be updated in-place
  ~ resource "azurerm_cdn_frontdoor_profile" "this" {
        id                       = "/subscriptions/02a23258-2e41-433c-8e9a-465b99e77bca/resourceGroups/dx-p-itn-common-rg-01/providers/Microsoft.Cdn/profiles/dx-p-weu-mcp-registry-afd-01"
        name                     = "dx-p-weu-mcp-registry-afd-01"
      ~ tags                     = {
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_cdn"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.2" -> "0.4.0"
            "Owner"          = "DevEx"
            "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mcp_registry.module.portal.azurerm_dns_cname_record.this["mcp.dx.pagopa.it"] will be updated in-place
  ~ resource "azurerm_dns_cname_record" "this" {
        id                  = "/subscriptions/02a23258-2e41-433c-8e9a-465b99e77bca/resourceGroups/dx-p-itn-network-rg-01/providers/Microsoft.Network/dnsZones/dx.pagopa.it/CNAME/mcp"
        name                = "mcp"
      ~ tags                = {
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_cdn"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.2" -> "0.4.0"
            "Owner"          = "DevEx"
            "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        }
        # (6 unchanged attributes hidden)
    }

  # module.mcp_registry.module.portal.azurerm_dns_txt_record.validation["mcp.dx.pagopa.it"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "validation" {
        id                  = "/subscriptions/02a23258-2e41-433c-8e9a-465b99e77bca/resourceGroups/dx-p-itn-network-rg-01/providers/Microsoft.Network/dnsZones/dx.pagopa.it/TXT/_dnsauth.mcp"
        name                = "_dnsauth.mcp"
      ~ tags                = {
            "Cdn"            = "dx-p-weu-mcp-registry-afd-01"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "Developer Experience"
            "ModuleName"     = "azure_cdn"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.3.2" -> "0.4.0"
            "Origin"         = "mcp.dx.pagopa.it"
            "Owner"          = "DevEx"
            "Source"         = "https://github.com/pagopa/dx/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 4 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.mcp_registry.module.portal.azurerm_cdn_frontdoor_custom_domain.this["mcp.dx.pagopa.it"],
  on .terraform/modules/mcp_registry.portal/custom_domain.tf line 14, in resource "azurerm_cdn_frontdoor_custom_domain" "this":
  14: resource "azurerm_cdn_frontdoor_custom_domain" "this" {

As of March 1, 2025, support for 'TLS10' will be retired from Azure Front
Door, therefore the 'TLS10' property value will be removed in v5.0 of the
provider.
```

</details>
